---
kind: method
id: M:Autodesk.Revit.DB.FaceArray.#ctor
source: html/cfb129d2-f569-507d-2534-b57e25b86719.htm
---
# Autodesk.Revit.DB.FaceArray.#ctor Method

Initializes a new instance of the FaceArray class

## Syntax (C#)
```csharp
public FaceArray()
```